__author__ = '최재혁'

KTOP30 = [ "KB금융", "LG디스플레이", "LG전자", "LG화학", "NAVER", "POSCO", "SK이노베이션", "SK텔레콤", "SK하이닉스", "기아차",
"다음카카오", "롯데케미칼", "삼성SDI", "삼성물산", "삼성생명", "삼성전기", "삼성전자", "삼성중공업", "삼성화재", "셀트리온",
"신한지주", "아모레퍼시픽", "이마트", "한국타이어", "현대건설", "현대글로비스", "현대모비스", "현대제철", "현대중공업", "현대차"]

KRX_100 = ["BNK금융지주", "CJ", "CJ대한통운", "CJ오쇼핑", "CJ제일제당", "DGB금융지주", "GKL", "GS", "GS리테일", "GS홈쇼핑",
"KB금융", "KB손해보험", "KCC", "KT&G", "LG", "LG디스플레이", "LG생활건강", "LG유플러스", "LG전자", "LG화학", "NAVER",
"POSCO", "S-Oil", "SK", "SK이노베이션", "SK텔레콤", "SK하이닉스", "강원랜드", "고려아연", "금호석유", "기아차", "기업은행",
"녹십자", "다음카카오", "대우인터내셔널", "대우조선해양", "대우증권", "동부화재", "동서", "두산", "두산중공업", "롯데쇼핑",
"롯데칠성", "롯데케미칼", "메디톡스", "미래에셋증권", "삼성SDI", "삼성물산", "삼성생명", "삼성에스디에스", "삼성전기",
"삼성전자", "삼성중공업", "삼성증권", "삼성카드", "삼성화재", "셀트리온", "신세계", "신한지주", "아모레G", "아모레퍼시픽",
"아이에스동서", "에스에프에이", "에스원", "엔씨소프트", "영원무역", "오리온", "오스템임플란트", "우리은행", "유한양행",
"이마트", "이오테크닉스", "제일기획", "컴투스", "코웨이", "파라다이스", "하나금융지주", "하나투어", "한국가스공사",
"한국금융지주", "한국전력", "한국타이어", "한국항공우주", "한미약품", "한샘", "한세실업", "한온시스템", "한전KPS",
"한전기술", "현대건설", "현대그린푸드", "현대글로비스", "현대리바트", "현대모비스", "현대백화점", "현대위아", "현대제철",
"현대차", "현대해상", "호텔신라"]


KRX_AUTOS = ["S&T모티브", "S&T중공업", "금호타이어", "기아차", "넥센타이어", "만도", "서연", "성우하이텍",
"세방전지", "아트라스BX", "에스엘", "평화정공", "한국타이어", "한국타이어월드와이드", "한라홀딩스", "한온시스템",
"현대모비스", "현대위아", "현대차", "화신"]

KRX_BANKS = [ "BNK금융지주", "DGB금융지주", "JB금융지주", "KB금융", "광주은행", "기업은행", "신한지주", "우리은행",
"제주은행", "하나금융지주"]

KRX_CONSTRUCTION = [ "GS건설", "대림산업", "대우건설", "두산중공업", "삼성엔지니어링", "태영건설", "한전KPS",
"한전기술", "현대건설", "현대산업"]

KRX_COMSUMER_STAPLES = ["CJ제일제당", "KT&G", "LG생활건강", "농심", "대상", "동서", "동원산업", "롯데제과", "롯데칠성",
"롯데푸드", "삼립식품", "삼양홀딩스", "아모레G", "아모레퍼시픽", "오뚜기", "오리온", "이마트", "하이트진로", "한국콜마",
"현대그린푸드"]


KRX_ENERGY_CHEMI = ["AK홀딩스", "GS", "KCC", "LG하우시스", "LG화학", "S-Oil", "SKC", "SK가스", "SK이노베이션",
"SK케미칼", "금호석유", "대한유화", "롯데케미칼", "삼성정밀화학", "코오롱인더", "태광산업", "한화", "한화케미칼",
"효성", "휴켐스"]

KRX_FINANCIALS_BANKS = ["KB손해보험", "NH투자증권", "대신증권", "대우증권", "동부화재", "동양생명", "메리츠금융지주",
"메리츠종금증권", "메리츠화재", "미래에셋증권", "삼성생명", "삼성증권", "삼성카드", "삼성화재", "코리안리",
"키움증권", "한국금융지주", "한화생명", "현대증권", "현대해상"]

KRX_GREEN = ["GS건설", "LG전자", "LG화학", "LS산전", "OCI", "OCI머티리얼즈", "SK텔레콤", "삼성SDI", "삼성전자",
"서울반도체", "아모레퍼시픽", "코오롱생명과학", "파인테크닉스", "한미반도체", "한화케미칼", "현대건설", "현대산업",
"현대중공업", "효성", "휴비스"]

KRX_HEALTH_CARE = [ "LG생명과학", "광동제약", "녹십자", "녹십자홀딩스", "대웅", "대웅제약", "대원제약", "대화제약",
"동국제약", "동아쏘시오홀딩스", "루트로닉", "메디톡스", "메디포스트", "바이넥스", "바텍", "보령제약", "부광약품",
"삼진제약", "서흥", "셀트리온", "쎌바이오텍", "씨젠", "씨티씨바이오", "아이센스", "오스템임플란트", "유나이티드제약",
"유한양행", "이연제약", "인바디", "일동제약", "제일약품", "종근당", "종근당홀딩스", "차바이오텍", "코오롱생명과학",
"한독", "한미사이언스", "한미약품", "환인제약", "휴온스"]

KRX_IT = [ "LG디스플레이", "LG이노텍", "LG전자", "LS", "LS산전", "NAVER", "NHN엔터테인먼트", "OCI머티리얼즈", "SK",
"SK하이닉스", "게임빌", "다우기술", "다음카카오", "동원시스템즈", "리노공업", "삼성SDI", "삼성전기", "삼성전자",
"서울반도체", "솔브레인", "신도리코", "에스에프에이", "엔씨소프트", "원익IPS", "웹젠", "위메이드", "이오테크닉스",
"컴투스", "포스코 ICT", "한국사이버결제"]

KRX_INSURANCE = ["KB손해보험", "동부화재", "동양생명", "메리츠화재", "삼성생명", "삼성화재", "코리안리", "한화생명",
"한화손해보험", "현대해상"]

KRX_LEISURE = [ "CJ CGV", "CJ E&M", "GKL", "강원랜드", "로엔", "모두투어", "에스엠", "와이지엔터테인먼트", "파라다이스",
"하나투어"]

KRX_MEDIA_TELECOM = [ "CJ CGV", "CJ E&M", "CJ헬로비전", "KT", "LG유플러스", "SBS", "SBS미디어홀딩스", "SBS콘텐츠허브",
"SK텔레콤", "iMBC", "나스미디어", "대교", "로엔", "스카이라이프", "에스엠", "예림당", "제이콘텐트리", "제일기획",
"키이스트", "현대에이치씨엔"]

KRX_RETAIL = ["CJ오쇼핑", "GS리테일", "GS홈쇼핑", "롯데쇼핑", "롯데하이마트", "신세계", "이마트", "현대백화점",
"현대홈쇼핑", "호텔신라"]

KRX_SRI = ["BNK금융지주", "CJ", "CJ E&M", "CJ대한통운", "CJ오쇼핑", "CJ제일제당", "CJ프레시웨이", "DGB금융지주",
"GS건설", "KB금융", "KT", "LG", "LG디스플레이", "LG생활건강", "LG유플러스", "LG이노텍", "LG전자", "LG화학",
"OCI", "POSCO", "S-Oil", "SK", "SKC", "SK이노베이션", "SK케미칼", "SK텔레콤", "SK하이닉스", "고려아연", "기아차",
"기업은행", "대림산업", "대우조선해양", "대우증권", "동부화재", "두산", "두산엔진", "두산인프라코어", "두산중공업",
"롯데쇼핑", "롯데제과", "롯데케미칼", "삼성SDI", "삼성생명", "삼성엔지니어링", "삼성전기", "삼성전자", "삼성중공업",
"삼성증권", "삼성카드", "삼성화재", "신세계", "신한지주", "아모레퍼시픽", "안랩", "우리은행", "이마트", "코웨이",
"포스코켐텍", "하나금융지주", "한국가스공사", "한국전력", "한국타이어", "한국타이어월드와이드", "한전KPS", "한화생명",
"현대건설", "현대모비스", "현대제철", "현대중공업", "현대해상"]

KRX_SRI_ECO = ["CJ제일제당", "CJ프레시웨이", "KT", "LG디스플레이", "LG생활건강", "LG유플러스", "LG전자", "POSCO",
"S-Oil", "SK", "SK이노베이션", "SK텔레콤", "두산중공업", "롯데쇼핑", "롯데칠성", "롯데케미칼", "삼성SDI", "삼성생명",
"삼성전기", "삼성전자", "삼성화재", "신한지주", "이마트", "코웨이", "포스코켐텍", "한국가스공사", "한국타이어",
"한화", "현대건설", "현대중공업"]

KRX_SECURITY = ["HMC투자증권", "NH투자증권", "교보증권", "대신증권", "대우증권", "메리츠종금증권", "미래에셋증권",
"삼성증권", "키움증권", "한국금융지주", "현대증권"]

KRX_SEMICON = [ "ISC", "OCI머티리얼즈", "SK하이닉스", "고영", "동진쎄미켐", "루멘스", "리노공업", "삼성전자",
"서울반도체", "솔브레인", "실리콘웍스", "아이원스", "원익IPS", "유니테스트", "유진테크", "이오테크닉스", "일진디스플",
"케이씨텍", "피에스케이", "한미반도체"]

KRX_SHIPBUILDING = ["대양전기공업", "대우조선해양", "두산엔진", "삼성중공업", "한국카본", "한라IMS", "한진중공업",
"현대미포조선", "현대중공업"]

KRX_STEELS = ["POSCO", "고려아연", "고려제강", "성광벤드", "세아베스틸", "세아제강", "영풍", "포스코켐텍", "풍산",
"현대제철"]

KRX_TRANSPORTATION = [ "AJ렌터카", "CJ대한통운", "대한항공", "아시아나항공", "한솔로지스틱스", "한진", "한진칼",
"한진해운", "현대글로비스", "현대상선"]

KRX_고배당_50 = ["E1", "GS홈쇼핑", "KB오토시스", "KPX케미칼", "KT&G", "KTcs", "POSCO", "SJM홀딩스", "SK텔레콤",
"강원랜드", "경동제약", "기업은행", "대교", "대덕전자", "대창단조", "동국산업", "동부화재", "동서", "동양생명",
"디스플레이텍", "디와이", "메가스터디", "메리츠화재", "무림P&P", "부광약품", "블루콤", "삼원강재", "삼호개발",
"서원인텍", "세아베스틸", "신도리코", "신영증권", "유아이엘", "율촌화학", "자화전자", "전파기지국", "종근당홀딩스",
"지역난방공사", "진양홀딩스", "청담러닝", "케이비캐피탈", "풍산홀딩스", "하이트진로", "한국쉘석유", "한미반도체",
"한양증권", "한전산업", "현대해상", "휴비스", "휴켐스"]

KOSPI100 = ["BNK금융지주", "CJ", "CJ대한통운", "CJ제일제당", "GKL", "GS", "KB금융", "KCC", "KT", "KT&G", "LG", "LG디스플레이",
"LG생활건강", "LG유플러스", "LG이노텍", "LG전자", "LG화학", "LS", "LS산전", "NAVER", "NH투자증권", "OCI", "POSCO",
"S-Oil", "SK", "SK네트웍스", "SK이노베이션", "SK텔레콤", "SK하이닉스", "강원랜드", "고려아연", "금호석유", "기아차",
"기업은행", "농심", "대림산업", "대우건설", "대우인터내셔널", "대우조선해양", "대우증권", "대한항공", "동부화재", "두산",
"두산인프라코어", "두산중공업", "롯데쇼핑", "롯데제과", "롯데칠성", "롯데케미칼", "미래에셋증권", "삼성SDI", "삼성물산",
"삼성생명", "삼성에스디에스", "삼성엔지니어링", "삼성전기", "삼성전자", "삼성중공업", "삼성증권", "삼성카드", "삼성화재",
"신세계", "신한지주", "아모레G", "아모레퍼시픽", "에스원", "엔씨소프트", "오리온", "우리은행", "유한양행", "이마트",
"제일기획", "코웨이", "하나금융지주", "한국가스공사", "한국금융지주", "한국전력", "한국타이어", "한국항공우주", "한샘",
"한온시스템", "한전KPS", "한전기술", "한화", "한화생명", "한화케미칼", "한화테크윈", "현대건설", "현대글로비스",
"현대모비스", "현대미포조선", "현대백화점", "현대산업", "현대상선", "현대위아", "현대제철", "현대중공업", "현대차",
"호텔신라", "효성"]

KOSPI200_건강관리 = ["LG생명과학", "광동제약", "녹십자", "대웅제약", "동아쏘시오홀딩스", "동아에스티", "부광약품",
"서흥", "영진약품", "유한양행", "일동제약", "일양약품", "종근당", "한미약품"]

KOSPI200_경기소비재 = ["GKL", "LF", "S&T모티브", "SBS", "SK네트웍스", "강원랜드", "경방", "금호타이어", "기아차",
"넥센타이어", "대교", "동아타이어", "롯데쇼핑", "모토닉", "베이직하우스", "삼성물산", "서연", "세방전지", "세종공업",
"신세계", "쌍용차", "에스엘", "에스원", "영원무역", "일신방직", "제일기획", "조광피혁", "코웨이", "한국타이어",
"한국타이어월드와이드", "한라홀딩스", "한샘", "한섬", "한세실업", "한솔홀딩스", "한온시스템", "현대리바트",
"현대모비스", "현대백화점", "현대위아", "현대차", "호텔신라", "화신"]

KOSPI200_고배당지수 = ["BNK금융지주", "GS", "KB금융", "KT&G", "LF", "LG", "LG디스플레이", "LG유플러스", "LS",
"LS산전", "POSCO", "S&T모티브", "SKC", "SK텔레콤", "강원랜드", "고려아연", "금호석유", "기아차", "기업은행",
"농심", "대우인터내셔널", "동부화재", "두산", "두산중공업", "빙그레", "삼성생명", "삼성전자", "삼성중공업", "삼성카드",
"삼성화재", "세아베스틸", "세아제강", "신한지주", "에스원", "코웨이", "풍산", "하나금융지주", "하이트진로", "한국금융지주",
"한국전력", "한국타이어", "한국타이어월드와이드", "한전KPS", "한전기술", "한화생명", "현대모비스", "현대제철",
"현대차", "휴켐스"]

KOSPI200_금융 = ["BNK금융지주", "KB금융", "NH투자증권", "기업은행", "대우증권", "동부화재", "미래에셋증권", "삼성생명",
"삼성증권", "삼성카드", "삼성화재", "신한지주", "우리은행", "하나금융지주", "한국금융지주", "한화생명", "현대증권"]

KOSPI200_생활소비재 = ["CJ", "CJ제일제당", "GS리테일", "KT", "KT&G", "LG생활건강", "LG유플러스", "SK텔레콤", "남양유업",
"농심", "대상", "동원F&B", "락앤락", "롯데제과", "롯데칠성", "롯데푸드", "무학", "빙그레", "삼립식품", "삼양사",
"삼양홀딩스", "아모레G", "아모레퍼시픽", "에이블씨엔씨", "오뚜기", "오리온", "이마트", "코스맥스", "크라운제과",
"팜스코", "하이트진로", "하이트진로홀딩스", "한국가스공사", "한국전력", "한국콜마", "현대그린푸드"]

KOSPI200_저변동성지수 = ["BNK금융지주", "CJ제일제당", "GS", "KB금융", "KT", "KT&G", "LF", "LG", "LG디스플레이", "LG전자",
"LS", "LS산전", "POSCO", "S&T모티브", "SBS", "SK텔레콤", "강원랜드", "고려아연", "금호석유", "금호타이어", "기아차",
"농심", "동부화재", "롯데쇼핑", "롯데제과", "빙그레", "삼성생명", "삼성전자", "삼성정밀화학", "삼성카드", "신한지주",
"아이에스동서", "에스원", "영진약품", "오리온", "유한양행", "이마트", "풍산", "하나금융지주", "하이트진로",
"한국가스공사", "한국타이어", "한국타이어월드와이드", "한화생명", "현대모비스", "현대백화점", "현대제철", "현대차",
"휴켐스"]

KOSPI200_중소형주지수 = ["GS리테일", "LF", "LG상사", "LG생명과학", "LG하우시스", "S&T모티브", "S&T중공업", "SBS",
"SKC", "SK케미칼", "경방", "고려제강", "광동제약", "국도화학", "금호타이어", "남양유업", "남해화학", "넥센타이어",
"녹십자", "대교", "대덕전자", "대상", "대웅제약", "대한유화", "동국제강", "동아쏘시오홀딩스", "동아에스티", "동아타이어",
"동원F&B", "동원시스템즈", "두산엔진", "락앤락", "롯데푸드", "모토닉", "무림P&P", "무학", "베이직하우스", "부광약품",
"빙그레", "삼광글라스", "삼립식품", "삼성정밀화학", "삼양사", "삼양홀딩스", "서연", "서흥", "세방전지", "세아베스틸",
"세아제강", "세종공업", "신도리코", "쌍용양회", "쌍용차", "아이에스동서", "에스엘", "에이블씨엔씨", "영원무역", "영진약품",
"영풍", "오뚜기", "유니드", "일동제약", "일신방직", "일양약품", "일진머티리얼즈", "조광피혁", "조선내화", "종근당",
"코스맥스", "코오롱인더", "크라운제과", "태광산업", "팜스코", "풍산", "하이트진로", "하이트진로홀딩스", "한국단자",
"한국쉘석유", "한국철강", "한국콜마", "한국타이어월드와이드", "한라홀딩스", "한미반도체", "한미약품", "한섬", "한세실업",
"한솔케미칼", "한솔테크닉스", "한솔홀딩스", "한일시멘트", "한진중공업", "현대그린푸드", "현대로템", "현대리바트",
"현대엘리베이", "현대증권", "화신", "후성", "휴비스", "휴켐스"]

KOSPI200_필수소비재 = ["CJ", "CJ제일제당", "GS리테일", "KT", "KT&G", "LG생명과학", "LG생활건강", "LG유플러스", "SK텔레콤",
"광동제약", "남양유업", "녹십자", "농심", "대상", "대웅제약", "동아쏘시오홀딩스", "동아에스티", "동원F&B", "락앤락",
"롯데제과", "롯데칠성", "롯데푸드", "무학", "부광약품", "빙그레", "삼립식품", "삼양사", "삼양홀딩스", "서흥",
"아모레G", "아모레퍼시픽", "에이블씨엔씨", "영진약품", "오뚜기", "오리온", "유한양행", "이마트", "일동제약",
"일양약품", "종근당", "코스맥스", "크라운제과", "팜스코", "하이트진로", "하이트진로홀딩스", "한국가스공사", "한국전력",
"한국콜마", "한미약품", "현대그린푸드"]


KOSPI50 = [ "KB금융", "KCC", "KT", "KT&G", "LG", "LG디스플레이", "LG생활건강", "LG전자", "LG화학", "NAVER", "POSCO",
"S-Oil", "SK", "SK이노베이션", "SK텔레콤", "SK하이닉스", "강원랜드", "고려아연", "기아차", "기업은행", "대우조선해양",
"롯데쇼핑", "롯데케미칼", "삼성SDI", "삼성물산", "삼성생명", "삼성에스디에스", "삼성전기", "삼성전자", "삼성중공업",
"삼성카드", "삼성화재", "신한지주", "아모레G", "아모레퍼시픽", "엔씨소프트", "오리온", "우리은행", "이마트", "코웨이",
"하나금융지주", "한국전력", "한국타이어", "한화생명", "현대건설", "현대글로비스", "현대모비스", "현대제철", "현대중공업", "현대차"]

KOSPI_대형주 = ["BGF리테일", "BNK금융지주", "CJ", "CJ대한통운", "CJ제일제당", "GKL", "GS", "GS리테일", "KB금융",
"KCC", "KT", "KT&G", "LG", "LG디스플레이", "LG생활건강", "LG유플러스", "LG이노텍", "LG전자", "LG화학", "NAVER", "NH투자증권",
"OCI", "POSCO", "S-Oil", "SK", "SK네트웍스", "SK이노베이션", "SK텔레콤", "SK하이닉스", "강원랜드", "고려아연", "금호석유",
"기아차", "기업은행", "대림산업", "대우건설", "대우인터내셔널", "대우조선해양", "대우증권", "대한항공", "동부화재",
"두산", "두산인프라코어", "두산중공업", "롯데쇼핑", "롯데제과", "롯데칠성", "롯데케미칼", "맥쿼리인프라", "미래에셋증권",
"삼성SDI", "삼성생명", "삼성에스디에스", "삼성전기", "삼성전자", "삼성중공업", "삼성증권", "삼성카드", "삼성화재",
"신한지주", "아모레G", "아모레퍼시픽", "에스원", "엔씨소프트", "영원무역", "영풍", "오리온", "우리은행", "유한양행",
"이마트", "제일기획", "코웨이", "하나금융지주", "한국가스공사", "한국금융지주", "한국전력", "한국타이어", "한국타이어월드와이드",
"한국항공우주", "한샘", "한온시스템", "한전KPS", "한전기술", "한화", "한화생명", "한화케미칼", "현대건설", "현대글로비스",
"현대모비스", "현대백화점", "현대산업", "현대위아", "현대제철", "현대중공업", "현대차", "현대해상", "호텔신라", "효성"]

KOSPI_배당성장50 = ["DRB동일", "KCC", "LG", "LG생활건강", "LG화학", "NICE", "SKC", "고려아연", "고려제강", "노루홀딩스",
"대덕GDS", "동부화재", "동원F&B", "롯데칠성", "롯데푸드", "삼광글라스", "삼립식품", "삼성전자", "삼진제약", "삼화페인트",
"서연", "세방전지", "아모레G", "아모레퍼시픽", "아세아", "엔씨소프트", "영원무역홀딩스", "영풍", "오뚜기", "유한양행",
"이수페타시스", "자화전자", "종근당홀딩스", "케이씨텍", "코스맥스비티아이", "크라운제과", "한국단자", "한국카본",
"한국콜마홀딩스", "한샘", "한세예스24홀딩스", "한솔케미칼", "한온시스템", "현대EP", "현대그린푸드", "현대글로비스",
"현대모비스", "현대백화점", "현대제철", "현대차"]

dictJongMokGroup = {"KTOP30":KTOP30,
"KRX_100":KRX_100,
"KRX_AUTOS":KRX_AUTOS,
"KRX_BANKS":KRX_BANKS,
"KRX_CONSTRUCTION":KRX_CONSTRUCTION,
"KRX_COMSUMER_STAPLES":KRX_COMSUMER_STAPLES,
"KRX_ENERGY_CHEMI":KRX_ENERGY_CHEMI,
"KRX_FINANCIALS_BANKS":KRX_FINANCIALS_BANKS,
"KRX_GREEN":KRX_GREEN,
"KRX_HEALTH_CARE":KRX_HEALTH_CARE,
"KRX_IT":KRX_IT,
"KRX_INSURANCE":KRX_INSURANCE,
"KRX_LEISURE":KRX_LEISURE,
"KRX_MEDIA_TELECOM":KRX_MEDIA_TELECOM,
"KRX_RETAIL":KRX_RETAIL,
"KRX_SRI":KRX_SRI,
"KRX_SRI_ECO":KRX_SRI_ECO,
"KRX_SECURITY":KRX_SECURITY,
"KRX_SEMICON":KRX_SEMICON,
"KRX_SHIPBUILDING":KRX_SHIPBUILDING,
"KRX_STEELS":KRX_STEELS,
"KRX_TRANSPORTATION":KRX_TRANSPORTATION,
"KRX_고배당_50":KRX_고배당_50,
"KOSPI100":KOSPI100,
"KOSPI200_경기소비재":KOSPI200_경기소비재,
"KOSPI200_고배당지수":KOSPI200_고배당지수,
"KOSPI200_금융":KOSPI200_금융,
"KOSPI200_생활소비재":KOSPI200_생활소비재,
"KOSPI200_저변동성지수":KOSPI200_저변동성지수,
"KOSPI200_중소형주지수":KOSPI200_중소형주지수,
"KOSPI200_필수소비재":KOSPI200_필수소비재,
"KOSPI50":KOSPI50,
"KOSPI_대형주":KOSPI_대형주,
"KOSPI_배당성장50":KOSPI_배당성장50 }